# Aritmetik işlemler

In [1]:
import pandas as pd ; import numpy as np

In [2]:
s1 = pd.Series(np.arange(4), index=["a","b","c","d"])
s2 = pd.Series(np.arange(5), index=["a","b","c","d","f"])

In [3]:
s1

a    0
b    1
c    2
d    3
dtype: int32

In [4]:
s2

a    0
b    1
c    2
d    3
f    4
dtype: int32

In [5]:
s1 + s2

# Dikkat ederseniz verilerin karşılığı olduğunda topladı eşleşmeyen veri olduğu zaman ise toplamayı yapmayım ekrana NaN yazdırdı.

a    0.0
b    2.0
c    4.0
d    6.0
f    NaN
dtype: float64

In [8]:
df1 = pd.DataFrame(np.arange(6).reshape(2,3), columns=list("ABC"),
                  index=["ali","ahmet"])
df2 = pd.DataFrame(np.arange(9).reshape(3,3), columns=list("ABC"),
                  index=["ali","ahmet","can"])

In [9]:
df1

       A  B  C
ali    0  1  2
ahmet  3  4  5

In [10]:
df2

       A  B  C
ali    0  1  2
ahmet  3  4  5
can    6  7  8

In [11]:
# Dataframe veri yapısındaki verileri toplarken yapılan işlemde karşılık gelen veri varsa toplamı yapıyor karşılık gelen veri yoksa toplamayı yapmıyor.

df1 + df2

         A    B     C
ahmet  6.0  8.0  10.0
ali    0.0  2.0   4.0
can    NaN  NaN   NaN

In [12]:
# Eşleşmeyen yada işlem yapılmayan aritmatik işlemlere 0 gibi özel bir değer ataması yapabiliriz.

df1.add(df2,fill_value=0)

         A    B     C
ahmet  6.0  8.0  10.0
ali    0.0  2.0   4.0
can    6.0  7.0   8.0

In [13]:
# Bu verisetinin çarpmaya göre tersini alabiliriz.

1/df1

              A     B    C
ali         inf  1.00  0.5
ahmet  0.333333  0.25  0.2

# bazı Özel işlemlerde vardır bunlar.
# Çarpma işlemei için "sub"
# Bölme işlemei için "div"
# Çarpma işlemi için "mul"
# Üst alma işlemi için "pow"

In [14]:
# Örneğin df1 elemanlarını 3 ile çarpmamızı isterse.

df1*3

       A   B   C
ali    0   3   6
ahmet  9  12  15

In [15]:
# Bu komutu başka bir şekilde'de yapabiliriz. 

df1.mul(3)

       A   B   C
ali    0   3   6
ahmet  9  12  15

In [16]:
df2

       A  B  C
ali    0  1  2
ahmet  3  4  5
can    6  7  8

In [17]:
# şimdi bir satırı ele alalım ve bu satırı s2 değişkenine atamasını yapalım.

s2 = df2.iloc[1]
s2

A    3
B    4
C    5
Name: ahmet, dtype: int32

In [18]:
# İndexleri eşleşen değerler arasında çıkarma işlemi yapılmış oldu.

df2 - s2

       A  B  C
ali   -3 -3 -3
ahmet  0  0  0
can    3  3  3

In [19]:
s2_sutun = df2["A"]
s2_sutun

ali      0
ahmet    3
can      6
Name: A, dtype: int32

In [20]:
# Bu yaptığım işlemde ise df2'nin sütünlarından s2_sutun değerini verdiğim değerler çıkarılmış oldu.

df2.sub(s2_sutun, axis="index")

       A  B  C
ali    0  1  2
ahmet  0  1  2
can    0  1  2

# Fonksyon kullanmak

# numpay fonksyonları pandas ile senkronize çalışmaktadır.

In [21]:
sv = pd.DataFrame(np.random.randn(4,3), columns=list("ABC"),
                 index=["ali","berk","can","efe"])
sv

             A         B         C
ali   0.885245 -0.336075  1.364463
berk  0.208823 -0.890996 -0.233406
can   0.742115 -1.452606 -0.316739
efe  -0.384791  1.623889  1.044930

In [22]:
# Peki bu değerlerin mutlak değerini almak istersek ne yapmalıyız.

np.abs(sv)

             A         B         C
ali   0.885245  0.336075  1.364463
berk  0.208823  0.890996  0.233406
can   0.742115  1.452606  0.316739
efe   0.384791  1.623889  1.044930

# İstersek satır veya sütün için bir fonksyon uygulayabiliriz. bunu ise "Apply" ile yapmaktayız.

In [23]:
# Şimdi maximum ve minimum değerlerini bulabileçeğim bir fonksyon tamımlamasını yapıyorum.

f=lambda x:x.max()-x.min()

In [24]:
# Tanımlamasını yaptığım fonksyonu burada çağırıyorum.

sv.apply(f)

A    1.270036
B    3.076495
C    1.681202
dtype: float64

In [25]:
# Eğer her satıra bu fonksyonu uygulamak istersek yapmamız gereken şu olmalıdır.

sv.apply(f,axis=1)

ali     1.700538
berk    1.099819
can     2.194722
efe     2.008679
dtype: float64

In [26]:
# Yazmış olduğumuz fonksyonuda kendi veri setimize uygulayabiliriz.

def karesi_al (x):
    return x**2

In [27]:
# Şimdi her veri stinin karesini alan fonksyonu kullanalım.

sv.apply(karesi_al)

             A         B         C
ali   0.783658  0.112947  1.861758
berk  0.043607  0.793874  0.054479
can   0.550735  2.110065  0.100324
efe   0.148064  2.637014  1.091879